src/Reports/ПФ_MXL_КМ6.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ПФ_MXL_КМ6</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/РасчетыПоЭквайрингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЭквайрингу</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<Comment>Денежные средства</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыОтветственныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОтветственныхЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кладовщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусыКассовойСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПеремещениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаЛицевыхСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСписанияСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемникВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемникЗачисленияСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Reports/ПФ_MXL_КМ6/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктурнаяЕдиница 	= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;	
	Касса 				= ?(Параметры.Свойство("Касса"), Параметры.Касса, СтруктурнаяЕдиница.ОсновнаяКасса);	
	Если Касса.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У структурной единицы не заполнена касса!" + Символы.ПС + Символы.ПС + "Невозможно вывести отчет кассира-операциониста (КМ-6)." + Символы.ПС + "Вам необходимо сначала заполнить кассу у структурной единицы.");
	Иначе 
		КассоваяСмена = ПолучитьКассовуюСменуНаСервереБезКонтекста(Касса);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	Элементы.ВыводитьРасшифровку.Пометка = ВыводитьРасшифровку;
	
	Если КассоваяСмена <> Неопределено Тогда	
		СформироватьНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
//
//
Процедура Сформировать(Команда)
	
	Если КассоваяСмена <> Неопределено Тогда	
		СформироватьНаСервере();
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать кассовую смену!");
	КонецЕсли;	
	
КонецПроцедуры

&Насервере
//
//
Процедура СформироватьНаСервере()
	
	Результат = СформироватьПечатнуюФормуКМ6();
	
КонецПроцедуры

&НаСервере
// Функция выполняет получение состояния кассовой смены на сервере.
//
Функция ПолучитьКассовуюСменуНаСервереБезКонтекста(Касса)
	
	ТекущаяСмена = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);
	Если ТекущаяСмена <> Неопределено И ТекущаяСмена.Свойство("КассоваяСмена") Тогда 
		Возврат ТекущаяСмена.КассоваяСмена;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции // ПолучитьСостояниеКассовойСменыНаСервере()

&НаСервере
// Функция формирует табличный документ обложки кассовой книги
//
Функция СформироватьПечатнуюФормуКМ6()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КМ6";
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.КассоваяСмена.ПФ_MXL_КМ6");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(РасчетыПоЭквайрингуОстаткиИОбороты.СуммаНачальныйОстаток), 0) КАК СуммаНачальныйОстаток,
	|	ЕСТЬNULL(СУММА(РасчетыПоЭквайрингуОстаткиИОбороты.СуммаКонечныйОстаток), 0) КАК СуммаКонечныйОстаток,
	|	ЕСТЬNULL(СУММА(РасчетыПоЭквайрингуОстаткиИОбороты.СуммаПриход), 0) КАК СуммаПриход,
	|	ЕСТЬNULL(СУММА(РасчетыПоЭквайрингуОстаткиИОбороты.СуммаРасход), 0) КАК СуммаРасход
	|ПОМЕСТИТЬ ВТРасчетыПоЭквайрингу
	|ИЗ
	|	РегистрНакопления.РасчетыПоЭквайрингу.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Авто, , ЭквайринговыйТерминал = &ЭТ) КАК РасчетыПоЭквайрингуОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.ИтогоПриход), 0) КАК ИтогоПриход,
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.ИтогоРасход), 0) КАК ИтогоРасход
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(СУММА(ВЫБОР
	|					КОГДА ПриходРасход.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	|							ИЛИ ПриходРасход.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтСтраховойКОмпании)
	|						ТОГДА ПриходРасход.СуммаПриход
	|					ИНАЧЕ 0
	|				КОНЕЦ + ВЫБОР
	|					КОГДА ПриходРасход.Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	|							И ПриходРасход.Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтСтраховойКОмпании)
	|						ТОГДА ПриходРасход.СуммаПриход
	|					ИНАЧЕ 0
	|				КОНЕЦ), 0) КАК ИтогоПриход,
	|		ЕСТЬNULL(СУММА(ВЫБОР
	|					КОГДА ПриходРасход.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту)
	|							ИЛИ ПриходРасход.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыСтраховойКОмпании)
	|						ТОГДА ПриходРасход.СуммаРасход
	|					ИНАЧЕ 0
	|				КОНЕЦ + ВЫБОР
	|					КОГДА ПриходРасход.Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту)
	|							И ПриходРасход.Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыСтраховойКОмпании)
	|							И ПриходРасход.Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.СдачаНаличныхВБанк)
	|							И ПриходРасход.Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеОтЭквайера)
	|							И ПриходРасход.Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВыплатаЗаработнойПлаты)
	|						ТОГДА ПриходРасход.СуммаРасход
	|					ИНАЧЕ 0
	|				КОНЕЦ), 0) КАК ИтогоРасход
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(
	|				&ДатаНачала,
	|				&ДатаОкончания,
	|				Авто,
	|				,
	|				ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|					И БанковскийСчетКасса = &Касса) КАК ПриходРасход
	|	ГДЕ
	|		ПриходРасход.Регистратор.НомерЧекаККМ > 0
	|		И ПриходРасход.Регистратор.НомерЧекаККМ <> 88888888
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВТРасчетыПоЭквайрингу.СуммаПриход),
	|		СУММА(ВТРасчетыПоЭквайрингу.СуммаРасход)
	|	ИЗ
	|		ВТРасчетыПоЭквайрингу КАК ВТРасчетыПоЭквайрингу) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток), 0) + ВТРасчетыПоЭквайрингу.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ЕСТЬNULL(СУММА(ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток), 0) + ВТРасчетыПоЭквайрингу.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			,
	|			ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|				И БанковскийСчетКасса В (&Касса)) КАК ДенежныеСредстваОстаткиИОбороты,
	|	ВТРасчетыПоЭквайрингу КАК ВТРасчетыПоЭквайрингу
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасчетыПоЭквайрингу.СуммаНачальныйОстаток,
	|	ВТРасчетыПоЭквайрингу.СуммаКонечныйОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ДенежныеСредства.Регистратор.Дата < &ДатаНачала
	|					ТОГДА ВЫБОР
	|							КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|								ТОГДА ДенежныеСредства.Сумма
	|							ИНАЧЕ -1 * ДенежныеСредства.Сумма
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаДоДатыНачалаСмены,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ДенежныеСредства.Регистратор.Дата >= &ДатаНачала
	|						И ДенежныеСредства.Регистратор.Дата <= &ДатаОкончанияДокументовПеремещение
	|					ТОГДА ВЫБОР
	|							КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|								ТОГДА ДенежныеСредства.Сумма
	|							ИНАЧЕ -1 * ДенежныеСредства.Сумма
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаПослеДатыНачалаСмены
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	|ГДЕ
	|	(ДенежныеСредства.Регистратор ССЫЛКА Документ.ПеремещениеДенежныхСредств
	|				И ДенежныеСредства.ТипДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные), ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта))
	|			ИЛИ ДенежныеСредства.Регистратор ССЫЛКА Документ.СписаниеДенежныхСредств
	|				И (ДенежныеСредства.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.СдачаНаличныхВБанк)
	|					ИЛИ ДенежныеСредства.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВыплатаЗаработнойПлаты))
	|			ИЛИ ДенежныеСредства.Регистратор ССЫЛКА Документ.ПоступлениеДенежныхСредств
	|				И ДенежныеСредства.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеОтЭквайера))
	|	И ДенежныеСредства.БанковскийСчетКасса В(&Касса)
	|	И ДенежныеСредства.Регистратор.НомерЧекаККМ > 0
	|	И ДенежныеСредства.Регистратор.НомерЧекаККМ <> 88888888";
	
	Запрос.УстановитьПараметр("ДатаНачала"							, КассоваяСмена.НачалоКассовойСмены);
	Запрос.УстановитьПараметр("ДатаОкончания"						, КассоваяСмена.ОкончаниеКассовойСмены);
	Запрос.УстановитьПараметр("ДатаОкончанияДокументовПеремещение"	, ?(КассоваяСмена.ОкончаниеКассовойСмены = Дата(1,1,1), ТекущаяДатаСеанса(), КассоваяСмена.ОкончаниеКассовойСмены));
	
	Запрос.УстановитьПараметр("Касса", КассоваяСмена.Касса);           
	
	ЭквайринговыйТерминал = ?(Касса.ЭквайринговыйТерминал <> Неопределено, Касса.ЭквайринговыйТерминал, Неопределено);		
	Запрос.УстановитьПараметр("ЭТ", ЭквайринговыйТерминал);   	
    
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ПродажиВозврат	= РезультатЗапроса[1].Выгрузить();
	Остатки			= РезультатЗапроса[2].Выгрузить();
	
	СторноПоДокументамИсключение = РезультатЗапроса[2].Выгрузить();
	
	СведенияООрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(КассоваяСмена.СтруктурнаяЕдиница.Организация, КассоваяСмена.Дата, ,);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.СтруктурнаяЕдиницаПредставление = КассоваяСмена.СтруктурнаяЕдиница.Наименование;
	ОбластьМакета.Параметры.ОрганизацияПредставление = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияООрганизации, "ОфициальноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияООрганизации.КодПоОКПО;
	ОбластьМакета.Параметры.ОрганизацияИНН           = СведенияООрганизации.ИНН;
	ОбластьМакета.Параметры.ПрограммаУчета           = "1С:Предприятие 8";
	
	Если ЗначениеЗаполнено(КассоваяСмена) Тогда 
		
		Касса = КассоваяСмена.Касса;
		ОбластьМакета.Параметры.КассаККМ	             = Касса;
		ОбластьМакета.Параметры.КассоваяСмена            = КассоваяСмена.Номер;
		ОбластьМакета.Параметры.НомерДокумента           = КассоваяСмена.Номер;
		ОбластьМакета.Параметры.ДатаДокумента            = КассоваяСмена.ОкончаниеКассовойСмены;
		ОбластьМакета.Параметры.НачалоСмены              = КассоваяСмена.НачалоКассовойСмены;
		ОбластьМакета.Параметры.ОкончаниеСмены           = КассоваяСмена.ОкончаниеКассовойСмены;		
		ОбластьМакета.Параметры.ККМПредставление	     = Касса.ККМКласс + ?(СокрЛП(Касса.ККМКласс) <> "",", ","") + Касса.ККМТип + ?(СокрЛП(Касса.ККМТип) <> "",", ","") + Касса.ККММарка;
		ОбластьМакета.Параметры.НомерПроизводителя       = Касса.ККМНомерПроизводителя;
		ОбластьМакета.Параметры.РегистрационныйНомер	 = Касса.ККМНомерРегистрационный;
		
	КонецЕсли;	
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.СуммаРубКоп= "Сумма" + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты() + "," 
												 + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодДробнойчастВалюты();
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	СуммаИтого			= 0;
	СуммаИтогоВозврат	= 0;		
	НачальныйОстаток	= 0;
	КонечныйОстаток		= 0;
	
	Для Каждого Строка Из ПродажиВозврат Цикл	
		ОбластьМакета.Параметры.Итого			= Строка.ИтогоПриход;
		ОбластьМакета.Параметры.ИтогоВозврат	= Строка.ИтогоРасход;
		ОбластьМакета.Параметры.Сотрудник = КассоваяСмена.АвторДокумента; 
		Если Остатки.Количество() <> 0 Тогда
			НачальныйОстаток = Остатки[0].СуммаНачальныйОстаток;
			КонечныйОстаток = Остатки[0].СуммаКонечныйОстаток;
		Иначе
			НачальныйОстаток = 0;
			КонечныйОстаток = 0;
		КонецЕсли;
		
		
		// Ни в фитнесе ни в салоне такой выборки нет, подобное выражение может искажать остатки и они не сходятся с тем, что отображено в Управлении кассовой смены.
		
		// Исключить движения по документам исключениям
		// Если СторноПоДокументамИсключение.Количество() <> 0 Тогда	
		//	НачальныйОстаток = НачальныйОстаток - СторноПоДокументамИсключение[0].СуммаДоДатыНачалаСмены;
		//	КонечныйОстаток = КонечныйОстаток - СторноПоДокументамИсключение[0].СуммаДоДатыНачалаСмены - СторноПоДокументамИсключение[0].СуммаПослеДатыНачалаСмены;	
		// КонецЕсли;
		
		ОбластьМакета.Параметры.НачальныйОстаток = НачальныйОстаток;
		// Не учитывать сумму Возврата в сумме на конец смены
		ОбластьМакета.Параметры.КонечныйОстаток = КонечныйОстаток + Строка.ИтогоРасход;
		ТабДокумент.Вывести(ОбластьМакета);
		
		СуммаИтого = СуммаИтого + Строка.ИтогоПриход;
		СуммаИтогоВозврат = СуммаИтогоВозврат + Строка.ИтогоРасход;
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
	
	ОбластьМакета.Параметры.Итого        = СуммаИтого;
	ОбластьМакета.Параметры.ИтогоВозврат = СуммаИтогоВозврат;
	
	ОбластьМакета.Параметры.СуммаВыручкиПрописью = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(
	СуммаИтого - СуммаИтогоВозврат, ,Ложь);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если ВыводитьРасшифровку Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваОстаткиИОбороты.ТипДенежныхСредств КАК ВидОплаты,
		|	СУММА(ДенежныеСредстваОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
		|	СУММА(ДенежныеСредстваОстаткиИОбороты.СуммаРасход) КАК СуммаРасход
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Авто,
		|			,
		|			ВЫБОР
		|					КОГДА БанковскийСчетКасса ССЫЛКА Справочник.Кассы
		|						ТОГДА БанковскийСчетКасса = &Касса
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ТипДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные), ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта))) КАК ДенежныеСредстваОстаткиИОбороты
		|ГДЕ
		|	ДенежныеСредстваОстаткиИОбороты.Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.СдачаНаличныхВБанк)
		|	И ДенежныеСредстваОстаткиИОбороты.Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВыплатаЗаработнойПлаты)
		|	И НЕ ДенежныеСредстваОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеДенежныхСредств
		|	И НЕ ДенежныеСредстваОстаткиИОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеОтЭквайера)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваОстаткиИОбороты.ТипДенежныхСредств";
		
		Запрос.УстановитьПараметр("ДатаНачала"   , КассоваяСмена.НачалоКассовойСмены);
		Запрос.УстановитьПараметр("ДатаОкончания", КассоваяСмена.ОкончаниеКассовойСмены);
		Запрос.УстановитьПараметр("Касса"        , КассоваяСмена.Касса);
		
		ВыручкаПоВидамОплат = Запрос.Выполнить().Выгрузить();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаВидОплаты");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыВидОплаты");
		
		СуммаИтогоРасшифровки		 = 0;
		СуммаИтогоВозвратРВсшифровки = 0;		
		
		Для Каждого Строка Из ВыручкаПоВидамОплат Цикл	
			
			ОбластьМакета.Параметры.ВидОплаты		= Строка.ВидОплаты;
			ОбластьМакета.Параметры.СуммаВыручки	= Строка.СуммаПриход;
			ОбластьМакета.Параметры.СуммаВозвратов	= Строка.СуммаРасход;
			ТабДокумент.Вывести(ОбластьМакета);
			
			СуммаИтогоРасшифровки		 = СуммаИтогоРасшифровки + Строка.СуммаПриход;
			СуммаИтогоВозвратРВсшифровки = СуммаИтогоВозвратРВсшифровки + Строка.СуммаРасход;
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогТаблицы");
		ОбластьМакета.Параметры.ВыручкаПоСчетчику = СуммаИтогоРасшифровки;
		ОбластьМакета.Параметры.СуммаВозвратов	  = СуммаИтогоВозвратРВсшифровки;
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Оборот");	
	
	Руководитель = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(КассоваяСмена.СтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.Руководитель, КассоваяСмена.Дата);
	Если Руководитель.Количество() > 0 Тогда 
		ОбластьМакета.Параметры.ФИОРуководителя = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Руководитель[0].Сотрудник));
	КонецЕсли;	

//	Кассир = ОбщегоНазначения.ПолучитьКассираДляЗакрытияСмены();
//	ОбластьМакета.Параметры.ФИОКассир = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(?(ЗначениеЗаполнено(Кассир.Наименование), Кассир.Наименование, ""));
	Кассир = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(КассоваяСмена.СтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.Кассир, КассоваяСмена.Дата);
	Если Кассир.Количество() > 0 Тогда 
		ОбластьМакета.Параметры.ФИОКассирОп = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Кассир[0].Сотрудник));
	КонецЕсли;
	
//	СтаршийКассир = Справочники.Организации.ПолучитьКассираОрганизации(КассоваяСмена.СтруктурнаяЕдиница.Организация);
//	ОбластьМакета.Параметры.ФИОСтаршийКассир = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(?(ЗначениеЗаполнено(СтаршийКассир), СтаршийКассир, Кассир.Наименование)); 
	СтаршийКассир = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(КассоваяСмена.СтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер, КассоваяСмена.Дата);
	Если СтаршийКассир.Количество() > 0 Тогда 
		ОбластьМакета.Параметры.ФИОКассир = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(СтаршийКассир[0].Сотрудник));
	КонецЕсли;
	
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПечатьСОборотом");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Возврат ТабДокумент;
	
КонецФункции // СформироватьПечатнуюФормуКМ6()

&НаКлиенте
// Процедура - обработчик команды "ВыводитьРасшифровку"
//
Процедура ВыводитьРасшифровку(Команда)
	
	ВыводитьРасшифровку = НЕ ВыводитьРасшифровку;
	Элементы.ВыводитьРасшифровку.Пометка = ВыводитьРасшифровку;
	Если КассоваяСмена <> Неопределено Тогда	
		СформироватьНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора"
//
Процедура КассоваяСменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.КассоваяСмена.Форма.ФормаВыбора_Упрощенная", Новый Структура("Касса", Касса),,,,, Новый ОписаниеОповещения("КассоваяСменаНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КассоваяСменаНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда 
		КассоваяСмена = ВыбранноеЗначение;
		СформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
